Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: ཡང་དག་པ་མ་ཡིན་པས་རྣམ་པར་བརྟགས་པའི་ཕྱིན་ཅི་ལོག་ལས་སྐྱེས་སོ། །
en: As they are not real, they have arisen from the falsehood of imputation.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་དེའི་ཚེ་ན་ཡང་འདི་སྙམ་དུ་
en: At that time bodhisattvas will think,

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་སྙིང་བརྩེ་བའི་གནས་ཡིན་ནོ། །
en: ‘Ordinary beings are the objects of our loving-kindness.

source: ཚོར་བའི་ཕུང་པོ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མི་རྟོགས་པས་ཚོར་བ་རྣམས་ཀྱིས་ཉོན་མོངས་པར་གྱུར་ཏོ། །
en: Since they do not understand the aggregate of feelings accurately, they are afflicted by their feelings.

source: བདེ་བའི་ཚོར་བ་ལ་ཡང་ཆགས། སྡུག་བསྔལ་གྱི་ཚོར་བ་ལ་ཡང་ཆགས། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ལ་ཡང་ཆགས་པ་སྐྱེད་དེ།
en: They become attached to pleasurable feelings, painful feelings, and feelings that are neither pleasurable nor painful.

source: ཚོར་བ་རྣམས་ཀྱིས་བཅིངས་པས་འཁོར་བ་ན་འཁོར་ཞིང་ལུས་གཅིག་ནས་ལུས་གཅིག་ཏུ་རྒྱུན་མི་འཆད་དེ།
en: Bound by such feelings, they wander throughout saṃsāra and pass from one body to another in an unbroken stream,

source: ཚོར་བའི་ཉོན་མོངས་པས་ནི་ཚོར་བའི་ཕུང་པོའི་མཚན་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་མི་ཤེས་པའི་ཕྱིར་རོ། །
en: because due to afflictive feelings, they do not understand the characteristics of the aggregate of feelings accurately.

source: བདག་ཅག་གིས་བུས་པ་སོ་སོའི་སྐྱེ་བོའི་རྗེས་སུ་བསླབ་པར་མི་བྱའི། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བའི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་བརྟག་པར་བྱའོ། །
en: We should not emulate such childish ordinary beings. Rather, we should accurately investigate the discernment of the aggregate of feelings.’

source: དེའི་ཚེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བའི་ཕུང་པོ་ལ་རྟོག་པ་ནི་ཕུང་པོ་མེད་པ་ཚོར་བའི་ཕུང་པོ་ཡིན་པ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་ཕུང་པོ་དེ་ཚོར་བའི་ཕུང་པོ་ཡིན་པ་དང་། ཕྱིན་ཅི་ལོག་གི་ཕུང་པོ་དེ་ཚོར་བའི་ཕུང་པོ་ཡིན་པ་དང་། མི་གནས་པའི་ཕུང་པོ་དེ་ཚོར་བའི་ཕུང་པོ་ཡིན་པར་རྟོགས་ཏེ
en: “When they accurately contemplate the aggregate of feelings, they will realize the aggregate of feelings to be a nonexistent aggregate, a false aggregate, a mistaken aggregate, and a nonabiding aggregate.

source: དེའི་ཚེ་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚོར་བའི་ཕུང་པོའི་མཚན་ཉིད་མཐོང་སྟེ། བྱས་པ་མེད། བྱེད་པ་མེད་དེ།
en: At that time, they will accurately see the characteristics of the aggregate of feelings to be uncreated and devoid of action.

source: ཚོར་བའི་ཕུང་པོ་ལ་ཚོར་བའི་ཕུང་པོའི་མཚན་ཉིད་ཀྱང་མི་མཐོང་ངོ་། །
en: They will not view the aggregate of feelings as having any characteristics of the aggregate of feelings.

source: དེ་ལྟར་ཚོར་བའི་ཕུང་པོ་ལ་རྟོག་པ་ན་
en: When contemplating the aggregate of feelings in this fashion,

source: ཚོར་བའི་ཕུང་པོ་ལ་ནང་ན་གནས་པར་མི་མཐོང་། ཚོར་བའི་ཕུང་པོ་ལ་ཕྱི་རོལ་ན་གནས་པར་མི་མཐོང་སྟེ།
en: they do not view the aggregate of feelings as existing within or without.

source: ཚོར་བ་བདག་ཅེས་བྱ་བ་ལ་མི་ཆགས། ཚོར་བ་བདག་གི་བ་ཞེས་བྱ་བ་ལ་མི་ཆགས་པས་ཚོར་བའི་ཕུང་པོ་ལ་གང་ནས་ཀྱང་མ་འོངས་ལ་བདག་པོ་མེད་དེ་ཆོས་གང་གིས་ཀྱང་མ་བསྐྱེད་པར་ཤེས་སོ། །
en: They are not attached to feelings being I , and they are not attached to feelings being mine. They thus understand that the aggregate of feelings does not come from anywhere, that it is ownerless, and that it is not brought into being by anything.

source: ཚོར་བ་དེ་ནི་ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དང་། སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ལས་ཚོར་བའི་ཕུང་པོ་ཞེས་རྣམ་གྲངས་སུ་བཏགས་པར་ཤེས་སོ། །
en: They know that feelings are mistaken, and that what is labeled the category of the aggregate of feelings manifests as the ripened effect of past actions.

source: ཚོར་བའི་ཕུང་པོ་ལ་ཡང་དག་པ་མ་ཡིན་པའི་རྒྱུ་དང་རྐྱེན་རྒྱུན་མི་འཆད་པར་སྤྱོད་པར་མཐོང་སྟེ།
en: They see the aggregate of feelings as the unbroken continuity of engagement in false causes and conditions.

source: དེའི་དུས་ན་འདས་པའི་ཚོར་བའི་ཕུང་པོ་ལ་མི་ལེན། མི་ཆགས། མི་ཞེན།
en: At that time, they do not grasp, desire, or cling to the aggregate of feelings of the past;

source: མ་འོངས་པའི་ཚོར་བའི་ཕུང་པོ་ལ་ཡང་མི་ལེན། མི་ཆགས། མི་ཞེན།
en: they do not grasp, desire, or cling to the aggregate of feelings of the future;

source: ད་ལྟར་གྱི་ཚོར་བའི་ཕུང་པོ་ལ་ཡང་མི་ལེན། མི་ཆགས། མི་ཞེན་ཏེ།
en: and they do not grasp, desire, or cling to the aggregate of feelings of the present.

source: གང་ཟག་དེས་བདེ་བའི་ཚོར་བ་ལས་འདོད་པའི་ཀུན་ནས་ཉོན་མོངས་པ་སེལ་ཏོ། །སྡུག་བསྔལ་གྱི་ཚོར་བ་ལས་ཞེ་སྡང་བའི་ཀུན་ནས་ཉོན་མོངས་པ་སེལ་ཏོ། །བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ལས་མ་རིག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་སེལ་བས་བརྩོན་འགྲུས་རབ་ཏུ་རྩོམ་མོ། །
en: “Such people exert themselves in removing the affliction of desire from pleasurable feelings, the affliction of aversion from painful feelings, and the affliction of ignorance from feelings that are neither pleasurable nor painful.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚེ་གལ་ཏེ་བདེ་བའི་ཚོར་བ་མྱོང་བ་ན་འདོད་པའི་སེམས་མི་སྐྱེ།
en: Then, the mind of desire will not arise when the bodhisattva experiences pleasurable feelings,

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་ན་ཞེ་སྡང་གི་སེམས་མི་སྐྱེ།
en: the mind of aversion will not arise when the bodhisattva experience painful feelings, and

source: བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བ་ན་གཏི་མུག་གི་སེམས་མི་སྐྱེའོ། །
en: the mind of delusion will not arise when the bodhisattva experiences feelings that are neither pleasurable nor painful.

source: འཇིག་རྟེན་འཛིན་བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་ཕལ་ཆེར་བདེ་བའི་ཚོར་བ་མྱོང་བ་ན་འདོད་པ་སྐྱེའོ། །
en: Lokadhara, for the most part, the mind of desire arises when childish ordinary beings experience pleasurable feelings,

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་ན་ཞེ་སྡང་སྐྱེའོ། །
en: the mind of aversion arises when they experience painful feelings, and

source: བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བ་ན་གཏི་མུག་སྐྱེ་སྟེ།
en: the mind of delusion arises when they experience feelings that are neither pleasant nor painful.

source: དེ་ལྟར་བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་དབང་གིས་ལྡོངས་པར་གྱུར་པས་ཚོར་བའི་ཕུང་པོ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མི་ཤེས།
en: Thereby, childish ordinary beings are blinded by attachment, aversion, and delusion and fail to accurately understand the aggregate of feelings just as it is.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་མཚན་ཉིད་མི་ཤེས་པས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལ་བདག་དང་། བདག་གི་བ་དང་། འདི་དང་གཞན་དུ་ཆགས་ཤིང་འཛིན་ཏོ། །
en: Failing to understand the characteristics of attachment, aversion, and delusion, they become attached and cling to attachment, aversion, and delusion as being I, mine , and so forth.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཚོར་བའི་ཕུང་པོ་འདི་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་དབང་དུ་མི་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who understand the aggregate of feelings accurately will not fall under the influence of attachment, aversion, and delusion.

source: གལ་ཏེ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེས་ན་ཡང་དེ་མ་ཐག་ཏུ་ཡོངས་སུ་སེལ་ཅིང་ཡང་དག་པའི་ལམ་ལ་ནན་ཏན་བྱེད་པར་འགྱུར་རོ། །
en: Even if attachment, aversion, and delusion should arise, they will immediately dispel them, taking them earnestly onto the genuine path.

source: བདེ་བའི་ཚོར་བ་མྱོང་བ་ལས་ནི་འདོད་ཆགས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་བསལ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་མོ། །
en: They diligently practice in order to remove the affliction of attachment from the experience of pleasurable feelings.

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་ལས་ནི་ཞེ་སྡང་གི་ཀུན་ནས་ཉོན་མོངས་པ་བསལ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་མོ། །
en: They diligently practice in order to remove the affliction of aversion from the experience of painful feelings.

source: བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་མྱོང་བ་ལས་ནི་གཏི་མུག་གི་ཀུན་ནས་ཉོན་མོངས་པ་བསལ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: They diligently practice in order to remove the affliction of delusion from the experience of feelings that are neither pleasant nor painful.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚོར་བ་རྣམ་པ་གསུམ་ཤེས་པར་བྱེད་དོ། །
en: Thus, they gain accurate understanding of the three types of feeling.

source: དེའི་ཚེ་ན་ཇི་ཙམ་དུ་ཚོར་བར་འགྱུར་བ་གལ་ཏེ་བདེ་བར་ཚོར་བ་དང་། སྡུག་བསྔལ་བར་ཚོར་བ་དང་། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ཀུན་ལའང་མི་ཆགས་ཏེ
en: Then, to that extent, as they experience feelings, they do not cling to pleasurable feelings, painful feelings, or feelings that are neither pleasant nor painful.

source: རིང་དུ་གྱུར་ནའང་འདོད་ཆགས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བར་འགྱུར། ཞེ་སྡང་གི་ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བར་འགྱུར། གཏི་མུག་གི་ཀུན་ནས་ཉོན་མོངས་པ་དང་བྲལ་བར་འགྱུར་ཏེ།
en: Distancing themselves from them, they become freed from the affliction of attachment, the affliction of aversion, and the affliction of delusion. Then,

source: ཚོར་བ་འབྱུང་བའི་དུས་ན་ཚོར་བའི་ཕུང་པོ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མི་རྟག་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ཞིང་ཤེས་པར་འགྱུར་རོ། །
en: when feelings occur, they will understand and regard the aggregate of feelings accurately as impermanent.

source: གལ་ཏེ་དེ་ལྟར་ཤེས་ནས་ཚོར་བའི་ཕུང་པོ་ལ་འདོད་པའི་ཆགས་པ་ཡོངས་སུ་གཅོད་པར་འགྱུར་ཏེ།
en: Having gained such understanding, they will disrupt attachment to the aggregate of feelings.

source: ཡོངས་སུ་གཅོད་པའི་ཚོར་བའི་ཕུང་པོ་ལ་ཞུགས་པས་འདོད་ཅིང་ཆགས་པའི་ལམ་དག་ཏུ་ཚོར་བ་རྣམས་ཀྱིས་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །
en: Having understood the disrupted aggregate of feelings in this way, they will no longer be afflicted by feelings on the paths of desire and attachment.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་གལ་ཏེ་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བའི་ཕུང་པོ་རྟོགས་ཤིང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཚོར་བའི་ཕུང་པོ་ཤེས་ནས་ཚོར་བའི་ཕུང་པོའི་ཀུན་འབྱུང་དང་། ཚོར་བའི་ཕུང་པོའི་འགོག་པ་དང་། ཚོར་བའི་ཕུང་པོའི་འགོག་པའི་ལམ་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ། །
en: If bodhisattvas understand and realize the aggregate of feelings accurately, they will understand the origin of the aggregate of feelings, the cessation of the aggregate of feelings, and the path leading to cessation of the aggregate of feelings.

source: དེ་ནས་ཚོར་བའི་ཕུང་པོས་མ་སྐྱེས་པ་ལ་མཚན་ཉིད་དུ་ཤེས།
en: Then they will understand the aggregate of feelings to be characterized as being unborn.

source: མ་སྐྱེས་པའི་མཚན་ཉིད་ཀྱིས་ཚོར་བའི་ཕུང་པོ་ལ་མཚན་མ་མེད་པ་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པར་འགྱུར་རོ། །
en: Through this characteristic of being unborn, they will understand and realize the aggregate of feelings to be free of marks.

source: འཇིག་རྟེན་འཛིན་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཚོར་བའི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་པ་ཞེས་བྱའོ། །
en: Lokadhara, this has been a discussion of how bodhisattva great beings contemplate the discernment of the aggregate of feelings.”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདུ་ཤེས་ཀྱི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་ཅེ་ན།
en: “Lokadhara, how do bodhisattva great beings contemplate the discernment of the aggregate of perception?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་རྟོག་པའི་ཚེ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་དེ་ཕྱིན་ཅི་ལོག་ལས་སྐྱེས་ཏེ་ཡང་དག་པ་མ་ཡིན་པ། སྙིང་པོ་མེད་པ། མི་བརྟན་པ། ཐོག་མ་ནས་མ་སྐྱེས་པའི་མཚན་ཉིད་ཆད་པས་རྒྱུ་དང་རྐྱེན་འདུས་པ་དང་། སྔོན་གྱི་ལས་ཀྱི་མཐུ་ལས་བྱུང་བ་མཐོང་ངོ་། །
en: When bodhisattva great beings accurately contemplate the aggregate of perception, they see that the aggregate of perception arises from error, and that it is false, unreal, unreliable, and has the characteristic of never having being born to begin with. Being discontinuous, they see it as a gathering of causes and conditions, and as having arisen through the power of past actions.

source: ཡང་འདི་སྙམ་དུ་ཕུང་པོ་མ་ཡིན་པ་ནི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་སྟེ་ཡང་དག་པ་མ་ཡིན་པའི་ཕུང་པོ་ནི་འདུ་ཤེས་ཀྱི་ཕུང་པོའོ། །
en: They think, ‘The aggregate of perception is a nonaggregate, for the aggregate of perception is a heap of falsehood.

source: ཕྱིན་ཅི་ལོག་གི་ཕུང་པོ་ནི་འདུ་ཤེས་ཀྱི་ཕུང་པོའོ། །
en: The aggregate of perception is a heap of error.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་འདུ་ཤེས་ཀྱི་ཕུང་པོའི་མཚན་མ་མེད་པ་ནི་དཔེར་ན་དབྱར་གྱི་སྨིག་རྒྱུ་བ་ལྟ་བུ་མིང་ཙམ་སྟེ།
en: The aggregate of perception lacks the marks of the aggregate of perception. It is just a label, like the mirages of summertime.

source: སྨིག་རྒྱུ་བའི་ཕུང་པོ་དང་འདྲ་བར་འདུ་ཤེས་ཀྱི་ཕུང་པོ་འདི་ཡང་དེ་དང་འདྲ་སྟེ།
en: The aggregate of perception is just like an aggregate of mirages.

source: རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ཀྱིས་འདུ་ཤེས་ཞེས་བཏགས་སོ། །
en: The label perception is imputed due to the perceptions of consciousness.’

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་ནི་ཡང་དག་པ་མ་ཡིན་པ་འདུ་ཤེས་འདིས་བཅིངས་ཏེ། བདེ་བར་རྣམ་པར་ཤེས། སྡུག་བསྔལ་དུ་རྣམ་པར་ཤེས། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་པར་རྣམ་པར་ཤེས། གྲང་བ་དང་ཚ་བར་རྣམ་པར་ཤེས། སྐྱེས་པ་དང་བུད་མེད་དུ་རྣམ་པར་ཤེས། ལམ་རྒྱུད་ལྔར་འཁོར་བར་རྣམ་པར་ཤེས། འདུས་པར་རྣམ་པར་ཤེས། གྱེས་པར་རྣམ་པར་ཤེས། འདས་པར་རྣམ་པར་ཤེས། མ་འོངས་པར་རྣམ་པར་ཤེས། ད་ལྟར་གྱིར་རྣམ་པར་ཤེས། བཟང་པོར་རྣམ་པར་ཤེས། ངན་པར་རྣམ་པར་ཤེས། ཡོད་པར་རྣམ་པར་ཤེས། མེད་པར་རྣམ་པར་ཤེས་སོ། །
en: “Childish ordinary beings are bound by such false perceptions, which they perceive as pleasure, pain, neither pleasure nor pain, heat, cold, male, female, cycling throughout the five classes of beings, gathering, dispersing, past, present, future, good, bad, existence, and nonexistence.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོའི་འདུ་ཤེས་ནི་ཕྱིན་ཅི་ལོག་ཡང་དག་པ་མ་ཡིན་པའི་དབང་དུ་གྱུར་པས་རྒྱུ་དང་རྐྱེན་ལ་རག་ལུས་ཏེ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཞེས་བཏགས་པ་ཙམ་དུ་ཟད་དོ། །
en: As the perceptions of childish ordinary beings are under the sway of false delusion, and dependent upon causes and conditions, the aggregate of perception is a mere imputation.

source: དེ་ལ་ནི་ནང་ངམ་ཕྱི་རོལ་ན་འདུ་ཤེས་ཞེས་བྱ་བ་མེད་དེ།
en: There are no so-called perceptions either internally or externally.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་ཡང་དག་པ་མ་ཡིན་པའི་འདུ་ཤེས་ཀྱིས་བཅིངས་པས་འདོད་ཆགས་སུ་རྣམ་པར་ཤེས། ཞེ་སྡང་དུ་རྣམ་པར་ཤེས། གཏི་མུག་ཏུ་རྣམ་པར་ཤེས།
en: Bound by their false perceptions, childish ordinary beings perceive in terms of attachment, aversion, and delusion.

source: བུ་དང་ཆུང་མར་རྣམ་པར་ཤེས་སོ། །
en: They perceive children and wives.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་གནས་ཏེ་ཡང་དག་པ་མ་ཡིན་པའི་ལམ་ལ་ཆགས་པས་འདུ་ཤེས་ཀྱི་ཕུང་པོས་འཁོར་བ་ན་འཁོར་བར་འགྱུར་ཏེ།
en: Childish ordinary beings rely on the aggregate of perception and are attached to their false paths. Therefore, they circle throughout saṃsāra due to the aggregate of perception.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཡང་དག་པ་མ་ཡིན་པར་མི་རྟོགས་སོ། །
en: They fail to understand accurately that the aggregate of perception is false.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་བདག་ཏུ་འདུ་ཤེས། ཕ་རོལ་པོར་འདུ་ཤེས་སོ། །
en: Childish ordinary beings perceive in terms of self and other.

source: སྐྱེས་པ་དང་བུད་མེད་དུ་འདུ་ཤེས་ཏེ་འདུ་ཤེས་ཀྱི་ཕུང་པོས་བཅིངས་པས་རྣམ་པར་མ་གྲོལ་ཏེ།
en: Perceiving male and female, they are bound by the aggregate of perception and are thus not liberated.

source: བདག་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཡིན་པ་དང་། བདག་གི་བ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཡིན་པར་ཆགས་ཤིང་འཛིན་ཏོ། །
en: They grasp and cling to the aggregate of perception as being I or mine .

source: བདག་ཅག་ནི་བུས་པ་སོ་སོའི་སྐྱེ་བོའི་རྗེས་སུ་བསླབ་པར་མི་བྱའོ། །
en: We should not emulate childish ordinary beings.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་ལྟར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་རྟོག་པ་ན་འདུ་ཤེས་ཀྱི་ཕུང་པོ་དེ་ལ་འདུ་ཤེས་ཀྱི་ཕུང་པོར་མི་དམིགས་པ་ན་སྨིག་རྒྱུ་བའི་ཕུང་པོ་ལ་སྨིག་རྒྱུ་བའི་ཕུང་པོར་མི་དམིགས་པ་བཞིན་ནོ། །
en: “When bodhisattva great beings accurately contemplate the aggregate of perception in this way, they will not apprehend the aggregate of perception as the aggregate of perception, just as one will not apprehend an aggregate of mirages as an aggregate of mirages.

source: བྱང་ཆུབ་སེམས་དཔའི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་སྨིག་རྒྱུ་བ་ཉིད་མཐོང་བས་
en: Bodhisattvas view the aggregate of perception as a mirage; thus,

source: འདས་པའི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་མི་ཆགས། མི་ལེན། མི་ཞེན།
en: they do not desire, take up, or cling to past aggregates of perception;

source: མ་འོངས་པའི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་མི་ཆགས། མི་ལེན། མི་ཞེན།
en: they do not desire, take up, or cling to future aggregates of perception;

source: ད་ལྟར་གྱི་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་མི་གནས།
en: and they do not dwell on the present aggregates of perception.

source: བདག་དང་གཞན་དུ་རྣམ་པར་མི་རྟོག་སྟེ།
en: They do not conceptualize self and other.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་འགོག་པ་ལ་ནན་ཏན་བྱེད་ཅིང་འདུ་ཤེས་ཀྱི་ཕུང་པོའི་ལམ་མ་སྐྱེས་པར་ཁོང་དུ་ཆུད་དོ། །
en: They exert themselves in the cessation of the aggregate of perception and understand the path of the aggregate of perception to be unborn.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་འོངས་པའི་གནས་དང་། སོང་བའི་གནས་ཡོད་པར་མི་མཐོང་སྟེ།
en: They do not view the aggregate of perception as having any basis for coming or any basis for going. Rather,

source: ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དང་། སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་ལས་སྐྱེས་ཏེ། ད་ལྟར་གྱི་རྐྱེན་གྱིས་རྣམ་པར་བཅིངས་སོ། །
en: they view it as something mistaken that arises from the cause of past actions, while being bound by current conditions.

source: ཕུང་པོ་མེད་པ་ནི་འདུ་ཤེས་ཀྱི་ཕུང་པོའོ། །
en: The aggregate of perception is a nonexistent aggregate.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་འོངས་པའི་གནས་ཀྱང་མེད། སོང་བའི་གནས་ཀྱང་མེད་པར་འབྱེད་ཅིང་རྟོག་ན་འདུ་ཤེས་ཀྱི་ཕུང་པོ་མ་སྐྱེས་པར་ཁོང་དུ་ཆུད་དོ། །
en: When they discern and contemplate that the aggregate of perception does not have any basis for coming or any basis for going, they realize the aggregate of perception to be unborn.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་དགག་པར་རྣམ་པར་མི་རྟོག་པ་ནི་འདུ་ཤེས་ཀྱི་ཚོར་བ་ཐམས་ཅད་དགག་པའི་ཕྱིར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཤེས་ཤིང་མཐོང་བ་ལ་གནས་པའི་ཕྱིར་རོ། །
en: They will also not conceptualize the cessation of the aggregate of perception; this is because they abide in accurate understanding and knowledge for all the feelings associated with perception to cease.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་རྟོག་པའི་ཚེ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་དང་བྲལ་ཏེ།
en: When bodhisattvas accurately contemplate the aggregate of perception, they are free from the aggregate of perception, such that,

source: འདུ་ཤེས་ཀྱི་ལམ་ལ་མི་གནས་པ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཤིང་མཐོང་བ་ལ་གནས་པ་དང་། འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་མི་ཆགས་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་རྣམ་པར་འབྱེད་ཅིང་རྟོག་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུ་ཤེས་ཀྱི་ཕུང་པོའི་ཀུན་འབྱུང་དང་། འགོག་པ་དང་། ཟད་པ་ཤེས་སོ། །
en: without dwelling on the path of perception, they adhere to an accurate knowledge and understanding of the aggregate of perception. Without being attached to the aggregate of perception, they accurately discern and contemplate the aggregate of perception. They also accurately understand the origination, cessation, and exhaustion of the aggregate of perception.

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདུ་ཤེས་ཀྱི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་རྟོག་པ་ཞེས་བྱ་སྟེ།
en: Lokadhara, this is how bodhisattva great beings contemplate the discernment of the aggregate of perception.

source: འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་ཆགས་པ་དང་བྲལ་བས་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་ཆགས་པ་གཅད་པའི་ལམ་ལ་ནན་ཏན་བྱེད་པར་འགྱུར་རོ།། །།
en: As they are free from attachment to the aggregate of perception, they apply themselves to the path, which disrupts attachment to the aggregate of perception.”

source: འཇིག་རྟེན་འཛིན་ཅེས་བྱ་བའི་མདོ་བམ་པོ་གཉིས་པ། འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་བྱེད་ཀྱི་ཕུང་པོ་རྣམ་པར་འབྱེད་པ་ལ་རྟོག་ཅེ་ན།
en: “Lokadhara, how then do bodhisattva great beings contemplate the discernment of the aggregate of formation?

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་བྱེད་ཀྱི་ཕུང་པོ་འདི་ནི་ཕྱིན་ཅི་ལོག་ལས་སྐྱེས་ཏེ། ཡང་དག་པ་མ་ཡིན་པའི་ཀུན་ཏུ་བརྟགས་པ་ལས་བརྟགས་པ་ཙམ་དུ་ཡོད་པས་རྟོགས་སོ། །
en: Lokadhara, bodhisattva great beings realize that the aggregate of formation arises from error and is a mere imputation based on false imputations.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚེ་ལུས་ཀྱིས་འདུ་བྱེད་པ་དང་། ངག་གིས་འདུ་བྱེད་པ་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་དང་། ཀུན་ལ་མི་གཙང་བ་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་ཉིད་དང་། བདག་མེད་པར་རྟོག་གོ། །
en: At that time, bodhisattvas contemplate how all physical, verbal, and mental formations are unclean, impermanent, painful, empty, and selfless.

source: དེ་ལྟར་རྟོག་པའི་ཚེ་འདི་སྙམ་དུ་
en: When contemplating this, they think,

source: ཕུང་པོ་མ་ཡིན་པ་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོའོ། །
en: ‘The aggregate of formation is a nonaggregate.

source: སྡུག་བསྔལ་གྱི་ཕུང་པོ་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོའོ། །
en: The aggregate of formation is a heap of suffering.

source: རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བའི་ཕུང་པོ་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོའོ། །
en: The aggregate of formation is a dependently originated aggregate.

source: གཟུགས་བརྙན་གྱི་ཕུང་པོ་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོའོ། །
en: The aggregate of formation is a heap of reflections.

source: འདུ་བྱེད་ཀྱི་ཕུང་པོ་ནི་མི་འཕེལ་བ། མི་འབྲི་བ། མ་བསྡུས་པའོ། །
en: The aggregate of formation does not increase or decrease; it is not gathered.

source: ལུས་ཀྱིས་འདུ་བྱེད་པ་དང་། ངག་གིས་འདུ་བྱེད་པ་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་བྱས་པ་མེད་དེ།
en: Given that all physical, verbal, and mental formations are uncreated,

source: མཁས་པ་དག་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོ་དེ་ལ་མི་ཆགས། མི་ལེན་ཏོ། །
en: the wise do not become attached to or grasp the aggregate of formation.

source: ལུས་ཀྱིས་འདུ་བྱེད་པ་རྣམས་ལུས་ཀྱི་ནང་ན་མི་གནས། ལུས་ཀྱི་ཕྱི་རོལ་ན་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་སོ། །
en: Physical formations do not exist within the body, outside it, or in-between.

source: ངག་གིས་འདུ་བྱེད་པ་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་ཡང་དེ་བཞིན་དུ་ནང་ན་ཡང་མི་གནས། ཕྱི་རོལ་ན་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་ཏེ།
en: Likewise, verbal and mental formations do not exist within, without, or in-between.

source: འདུ་བྱེད་ཀྱི་ཕུང་པོ་ལ་འདུ་བྱེད་ཀྱི་ཕུང་པོའི་མཚན་ཉིད་མེད་དོ། །
en: “ ‘The aggregate of formation lacks the characteristics of the aggregate of formation.

source: འདུ་བྱེད་ཀྱི་ཕུང་པོ་དེ་ནི་རྒྱུ་དང་རྐྱེན་མང་པོ་དང་། ཕྱིན་ཅི་ལོག་དང་། ཡང་དག་པ་མ་ཡིན་པ་དང་། སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ལས་སྐྱེས་ཏེ་
en: The aggregate of formation arises from many causes and conditions, mistaken perceptions, false perceptions, and the ripening of the effects of past actions.

source: རྒྱུ་དང་རྐྱེན་གྱིས་བཟུང་བས་ན་འདུ་བྱེད་རྣམས་བྱས་པར་གྱུར་ཏོ། །
en: Formations are thus manifested due to the influence of causes and conditions.

source: ལུས་ཀྱིས་འདུ་བྱེད་པ་དང་། ངག་གིས་འདུ་བྱེད་པ་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་ཀུན་ཀྱང་ཡང་དག་པར་འདུ་བྱ་བ་མ་ཡིན། ཅིའང་འདུ་བྱེད་པ་མེད་དེ།
en: No physical, verbal, and mental formations are truly formed, and they form nothing at all.

source: ཡང་དག་པ་མ་ཡིན་པ་ལས་འདུ་བྱེད་པ། ཕྱིན་ཅི་ལོག་ཏུ་འདུ་བྱེད་པ་སྟེ།
en: Formations come from what is false, and they are formed out of mistaken perception.

source: དེ་བས་ན་འདུ་བྱེད་མ་ཡིན་པ་ལ་འདུ་བྱེད་ཀྱི་ཕུང་པོ་ཞེས་བཏགས་སོ། །
en: Therefore, the aggregate of formation refers to nonformations.

source: མཁས་པ་དེ་དག་གིས་ནི་འདུ་བྱེད་ཀྱི་མཚན་ཉིད་ལ་མ་ངེས་པས་
en: The wise do not ascertain any characteristics of formations. Therefore,

source: ལུས་ཀྱིས་འདུ་བྱེད་པ་དང་། ངག་གིས་འདུ་བྱེད་པ་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་དག་གནས་འདི་ནའམ། གནས་གཞན་ནའམ། ནང་ངམ། ཕྱི་རོལ་ན་གནས་པར་མ་ངེས་པའི་ཕྱིར་རོ། །
en: there are no physical, verbal, or mental formations to be ascertained anywhere—whether here or somewhere else, inside or outside.

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་འདུ་བྱེད་པ་ཡང་འདུ་བྱེད་ཀྱི་མཚན་ཉིད་དུ་ངེས་པ་མེད། དམིགས་སུ་མེད། བརྗོད་དུ་མེད་ན།
en: If physical, verbal, and mental formations cannot be ascertained, observed, or described as having the characteristics of formations,

source: འདུ་བྱེད་ཀྱི་ཕུང་པོ་དམིགས་སུ་ཡོད་པའམ་བརྗོད་དུ་ཡོད་པ་ལྟ་ཅི་སྨོས་ཏེ།
en: how could we talk about apprehending or describing an aggregate of formation?

source: དེ་བས་ན་ཕུང་པོ་མེད་པ་ནི་འདུ་བྱེད་ཀྱི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Thus, the aggregate of formation is a nonexistent aggregate.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ནི་ཕྱིན་ཅི་ལོག་ཏུ་འདུ་ཤེས་བསྐྱེད་ནས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་འདུ་བྱེད་པ་ལ་ཆགས་ཏེ།
en: “Having developed mistaken perceptions, childish ordinary beings grow attached to the formations of body, speech, and mind.

source: འདུ་བྱེད་ཀྱི་ཕུང་པོ་ལ་རྣམ་པར་རྟོག་པས་འདུ་བྱེད་ཀྱི་ཕུང་པོས་བཅིངས་ཏེ་འཁོར་བ་ན་འཁོར་བར་གྱུར་ཏོ། །
en: As they conceptualize the aggregate of formation and are bound by it, they cycle in saṃsāra.
